import React, {Component} from 'react';
import Header from "src/view/container/header/header";
import Footer from "src/view/container/footer/footer";
import "./home.scss";
import {Button, Col, Container, Form, FormControl, Row} from "react-bootstrap";

var discription :string = 'این سایت بهترین کار را برای شما پیدا می کند'
class Home extends Component {
    render() {
        return (
            <div>
                {Header.call(this)}
                <main>
                    <div className={"tifani bar"}>
                    <Container>
                        <Row>
                            {/*<Col>*/}
                            <h3 > جاب اونجا خوب است! </h3>
                            {/*</Col>*/}

                        </Row>
                        <Row>
                            {/*<Col>*/}
                            <p>{discription}</p>
                            {/*</Col>*/}
                        </Row>
                        <Row  className={"search_form"}>

                            <Form>
                                <Col >
                                <FormControl type="email" placeholder="جستجو در جاب اونجا" />
                                <Button variant="primary" type="submit">
                                    جستجو
                                </Button>
                                </Col>
                            </Form>

                            {/*<Col sm={4}>*/}
                                {/*hi*/}
                            {/*</Col>*/}
                        </Row>
                    </Container>
                    </div>
                    <p>
                        ￼
                        مناسب به وسیلەی صفحات وب به کمک HTML/CSS ایجاد کنید. در این قسمت از پروژه صفحات پیادهسازی شده به صورت  ایستا هستند و ارتباطی با سرور نوشته شده در قسمت قبلی نخواهند داشت. در فازهای بعدی، این رابط کاربری را به سرور متصل
                        خواهید کرد.
                        فاز چهارم پروژه
                        هدف این پروژه آشنایی هر چه بیشتر شما با CSS، زبان نشانهگذاری HTML و چارچوب Bootstrap است. در این فاز مجاز به استفاده از هیچ گونه کد و کتابخانه به زبان JavaScript نیستید. شما باید تعدادی از صفحات دادهشده را همانند عکسهایی از محیط کاربری پروژه تهیه شده پیادهسازی نمایید، در پیادهسازی مابقی صفحات نیز میتوانید به دلخواه و سلیقه خود، ظاهر صفحات
                        را تغییر دهید. در این پروژه نکات زیر را مد نظر خود قرار دهید: • نرم افزار شما شامل پنج صفحەی خانه، پروفایل کاربر، مشخصات کامل پروژه، ورود و ثبت نام کاربر است.
                        طراحی های سه صفحەی اول در اختیار شما قرار دارد. دو صفحەی دیگر را نیز باید با خلاقیت خودتان طراحی کنید.
                        • در این فاز از پروژه، تنها لازم است سه صفحه از پنج صفحه را پیادەسازی کنید. این سه صفحه شامل دو صفحەی پروفایلکاربر و مشخصاتکامل پروژه، به علاوەی صفحەی ثبت نام است.
                        • پیادەسازی صفحات پروفایل کاربر و مشخصات کامل پروژه باید دقیقا مطابق با طرحهای گرافیست باشد. برای پیادەسازی صفحه سوم مطابق سلیقەی خود یک طرح جدید را پیادەسازی کنید اما باید این صفحه شامل یک اسلایدشو نیز باشدکهکماکان هیچکد جاوا اسکریپتی را استفاده نمیکند.
                        • تمامی صفحاتی که پیادهسازی می کنید باید Responsive باشند. برای Responsive بودن تنها دو حالت نمایش تبلت و دسکتاپ کفایت میکند. کمترین رزولوشنی که پروژه شما برروی آن تست می شود ٧۶٨*١٠٢۴ )ابعاد iPad( می باشد. توصیه می شود که برای پیادهسازی Responsive بودن صفحات از چارچوب
                        Bootstrap استفاده نمایید. • تمام نمادها1 از سایت flaticon استفاده شده و فایل backup آن، در فایلهای جانبی پروژه هست.کافی است
                        شما در سایت عضو بشید و فایل backup را import کنید و بعد نسخەی Iconfont آن را دانلود کنید. در فایل دانلودی شما، یک فایل HTML وجود داردکه آموزش استفاده از این نمادها در آن آمدەاست.
                        • حتما از یک فایل Normalize CSS یا Reset CSS در پروژه خود استفاده نمایید. از شما انتظار می رود در رابطه با دلیل استفاده از اینگونه فایل هاکمی مطالعهکرده باشید.
                        • تصاویری که باید به عنوان پس زمینه استفاده شوند در اختیار شما قرار گرفته است. توصیه می شود قبل از استفاده از آنها، به وسیله نرم افزارهایکاهش حجم عکس یا ابزارهای آنلاین مربوطه، حجم این تصاویر راکاهش دهید.
                        • تمام صفحات شامل footer ثابت هستند و همیشه در انتهای صفحه میباشد، مستقل از محتوای صفحه. دقت کنیدکه footer در پایین صفحەی HTML ثابت است، نه در پایین پنجرەی مرورگر.
                        جاباونجا!
                        مقدمه
                        ￼￼￼￼1 icons
                        1!
                        • قسمتبالاییصفحاتheader)کهشامللوگووقسمتناحیهکاربریاست(،باپایینآمدندرصفحاتهم￼ چنان دیده می شود و همیشه بالای پنجرەی مرورگر ثابت است.
                        • در تمامی صفحات، باکلیک روی دکمه ناحیهکاربری در header،کاربر باید به صفحەی پروفایل خود و باکلیک کردن روی لوگوی موجود در نوار بالای صفحه، باید به صفحەی خانه هدایت شود.
                        در پیادەسازی خود به نکات زیر توجه کنید
                        • صفحات شما باید به زبان فارسی و به صورت راست به چپ )RTL( باشند. • فایل های CSS و HTML باید از هم جدا باشند و استفاده از تگ یا صفت style در صفحات HTML مجاز
                        نمیباشد. • نکات مربوط به شبکهبندی صفحات را حتما رعایت کنید. استفاده از جدول2 و امکان جدید dispaly:grid برای
                        قالب بندی مجاز نیست. توصیه میشود برای اینکار از امکان grid چارچوب Bootstrap استفاده نمایید. • در این تمرین به هیچ وجه مجاز به استفاده از جاوا اسکریپت نیستید. دقت داشته باشید که در پروژەی خود مجاز
                        به استفاده از فایل JavaScript چارچوب Bootstrap نیز نیستید.
                        • پیادەسازی صفحات پروفایل کاربر و مشخصات کامل پروژه باید کاملا منطبق بر طراحی های داده شده به شما
                        باشد. توجه داشته باشید که در این طراحی ها اندازەی اجزا صفحات نسبی هستند و نیازی نیست که دقیقا همان اندازه باشند. ولی پیادەسازی شما باید از نظر ظاهر و ترکیب بندی همانند عکس ها باشد، یعنی نسبت اندازه و مکان اجزا را کاملا رعایت شود. همچنین توصیه می شود که در پیادەسازی صفحه ثبتنام، از قالب گرافیکی کل
                        سایت پیرویکرده، و تنها در صورت علاقه، چینش اجزاء را تغییر دهید.
                        • می توانید از ابزارهایی نظیر colorzilla و measureit یا GPick برای تشخیص رنگ ها و اندازههای عکس ها
                        استفادهکنید. همچنین به ضخامت متن های مورد استفاده نیز دقت داشته باشید. • در مکان های مناسب از امکاناتی نظیر table ،placeholder و pseudo-class حتما استفاده کنید. به صورت
                        کلی سعیکنیدکاربرد selectorهایگوناگون در css را فرابگیرید. • فونت استفاده شده در این صفحات Vazir نام دارد. این فونت را می توانید از طریق این صفحه دریافت نمایید. • حتما کدهای نوشته شده را با validator.w3.org وjigsaw.w3.org/css-validator چک کنید. • از شما انتظار می رود در این پروژه به طراحی کلاس های css و نحوەی استفاده از آن ها توجه ویژەای نشان دهید.
                        به عنوان مثال کلاس ها باید طوری طراحی شوند که از تکرار کد در آن ها جلوگیری شود. همچنین کلاس ها و کدهای css شما تا حد امکان باید به صورت عمومی طراحی شوند تا بتوان از آن در جاهای مختلف استفادهکرد.
                        نکات زیر احتمالا در پیادهسازی این تمرین به شماکمک میکند
                        • شاخصەی display در css نحوەی نمایش یک آیتم در صفحه را تعیین می کند. این شاخصه می تواند مقادیر مختلفی مانند block یا inline یا inline-block و غیره بگیرد. راجع به این مقادیر می توانید در اینترنت بخوانید. در نسخەی سوم css نحوەی نمایش جدیدی برای display به نام flexbox اضافه شد. نحوەی تعیین نمایش المنت ها توسط این مشخصه سادەتر و گویاتر است، اما برای استفاده از آن مرورگر شما باید بروز باشد. در صورتی که کار کردن با block و inline برای شما سخت و آزاردهنده است، می توانید از این روش برای
                        تعیین چیدمان صفحه استفادهکنید. در این لینک نحوەیکار با flexbox توضیح داده شده است. • شاخصەی position در css نحوەی قرار گیری یک آیتم در صفحه را تعیین می کند. برای ثابت کردن نوار بالای
                        صفحه باید از این شاخصه استفادهکنید. برای آشنایی با این شاخصه از این لینک استفادهکنید.
                        • برای پیادهسازی انیمیشن در css از دو روش کلی استفاده می شود. روش اول تعیین نحوەی تغییر مشخصات یک المنت، که با transition شناخته می شود، است. از این روش می توانید برای پیادهسازی حالت تغییر دکمەهای صفحه استفادهکنید. روش دومکهکمی پیچیدەتر است، استفاده از تعیین stateهای مختلف برای تغییرات است.
                        از این روش می توانید برای پیادهسازی اسلایدشو استفادهکنید.
                        ￼￼￼￼￼￼2 table
                        2!
                        • عموما به نواری که دکمەهای راهبری صفحه قرار دارد navigation bar یا navbar می گویند. نوار بالای صفحه￼ که باید ثابت باشد نیز نوعی navbar است.
                        • قسمت پایینی سایتکه قرار است عبارتهایکپیرایت در آن قرار بگیرد، footer نام دارد. • برای گرد کردن گوشەی مربع از شاخصەی border-radius استفاده کنید. همچنین می توانید از کلاس های
                        Bootstrap نیز برای اینکار استفادهکنید.
                        • دقت کنید که برای تعیین طول و عرض یک المنت به صورت نسبی می توانید مقدار شاخصەهای width و
                        height را به صورت درصدی بیانکنید. • در موارد استفاده پیشرفتەتری از CSS، توابع calc ،var و متغیرها و همچنین دستور import به شما در تولید
                        کدهای تمیزتر و بهتر بسیار کمک می کنند. همچنین واحدهای اندازەگیری em یا vh و vw در CSS به شما در پیادەسازی نسبی و Responsive اجزاء کمک می کند. همچنین در CSS می توانید اندازەها را بر حسب درصد بیانکنید. یکی از ابزارهای بسیارکاربردیکه در هنگام توسعەیکدهای html css به وفور از آن استفاده می شود، inspector است. این ابزار در مروگرهای مختلف با نام های مختلفی شناخته میشود. از این ابزار میتوانید برای تغییر در لحظەی مشخصات css و همچنین دیدن مشخصات اعمال شده بر روی المنتهای صفحه استفادهکنید.
                        به عنوان مثال می توانید از این ابزار
                    </p>
                </main>
                {Footer.call(this)}
            </div>
        );
    }
}

export default Home;